In [3]:
import pandas as pd
import numpy as np
# from pandas import Seriesries, DataFrame

# 1.Pandas的数据结构(Series，DataFrame)
## Series

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

自己指定index的label

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

## DataFrame
DataFrame有几种不同的生成方式，如代码所示  
1. 直接导入数据

In [7]:
dates = pd.date_range('20200821', periods=6)  # 生成一些日期索引

df = pd.DataFrame(np.random.randn(6 ,4), index=dates, columns=['a','b','c','d'])
df

                   a         b         c         d
2020-08-21 -0.142462  0.661817  0.963603  1.143843
2020-08-22 -1.936878  1.048949 -2.518404 -0.335548
2020-08-23 -1.081067 -0.416776  1.322992 -0.868166
2020-08-24  0.702628 -0.569252 -1.801597 -0.048565
2020-08-25 -0.293036  1.892943  1.832948 -0.464343
2020-08-26 -0.795368  1.340763  1.106267  0.482130

2. 以字典形式生成

In [8]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [10]:
print(df.index,    
df.columns,
df.values)                # 打印DataFrame的行名称、列名称、值

RangeIndex(start=0, stop=6, step=1) Index(['state', 'year', 'pop'], dtype='object') [['Ohio' 2000 1.5]
 ['Ohio' 2001 1.7]
 ['Ohio' 2002 3.6]
 ['Nevada' 2001 2.4]
 ['Nevada' 2002 2.9]
 ['Nevada' 2003 3.2]]

In [11]:
df.describe()  # 对数字形式的数据进行描述

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [12]:
df.sort_index(axis=1, ascending=False)  # sort by row  or column

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [13]:
df.sort_index(axis=0, ascending=False)

    state  year  pop
5  Nevada  2003  3.2
4  Nevada  2002  2.9
3  Nevada  2001  2.4
2    Ohio  2002  3.6
1    Ohio  2001  1.7
0    Ohio  2000  1.5

In [14]:
df.sort_values(by='pop')  # sort by values

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
2    Ohio  2002  3.6

# 2.Pandas选择数据

In [15]:
dates = pd.date_range('20200821', periods=6)
df = pd.DataFrame(np.arange(24).reshape((6, 4)), index=dates, columns=['a','b','c','d'])
df

             a   b   c   d
2020-08-21   0   1   2   3
2020-08-22   4   5   6   7
2020-08-23   8   9  10  11
2020-08-24  12  13  14  15
2020-08-25  16  17  18  19
2020-08-26  20  21  22  23

In [16]:
print(df['a'],df.a)  # 打印指定列数据
print(df[0:3],df['20200821':'20200823'])

2020-08-21     0
2020-08-22     4
2020-08-23     8
2020-08-24    12
2020-08-25    16
2020-08-26    20
Freq: D, Name: a, dtype: int32 2020-08-21     0
2020-08-22     4
2020-08-23     8
2020-08-24    12
2020-08-25    16
2020-08-26    20
Freq: D, Name: a, dtype: int32
            a  b   c   d
2020-08-21  0  1   2   3
2020-08-22  4  5   6   7
2020-08-23  8  9  10  11             a  b   c   d
2020-08-21  0  1   2   3
2020-08-22  4  5   6   7
2020-08-23  8  9  10  11

In [17]:
# select by label
print(df.loc[:,['a','b']])

             a   b
2020-08-21   0   1
2020-08-22   4   5
2020-08-23   8   9
2020-08-24  12  13
2020-08-25  16  17
2020-08-26  20  21

In [18]:
# select by position
print(df.iloc[:2,1:3])

            b  c
2020-08-21  1  2
2020-08-22  5  6

In [20]:
# Boolean indexing
print(df)
print(df[df.a > 12])

             a   b   c   d
2020-08-21   0   1   2   3
2020-08-22   4   5   6   7
2020-08-23   8   9  10  11
2020-08-24  12  13  14  15
2020-08-25  16  17  18  19
2020-08-26  20  21  22  23
             a   b   c   d
2020-08-25  16  17  18  19
2020-08-26  20  21  22  23

# 3.处理丢失的数据

In [21]:
df

             a   b   c   d
2020-08-21   0   1   2   3
2020-08-22   4   5   6   7
2020-08-23   8   9  10  11
2020-08-24  12  13  14  15
2020-08-25  16  17  18  19
2020-08-26  20  21  22  23

In [22]:
# 这里利用之前的df，随便赋值几个nan进去
df.iloc[0,1] = np.nan
df.iloc[4,2] = np.nan
df

             a     b     c   d
2020-08-21   0   NaN   2.0   3
2020-08-22   4   5.0   6.0   7
2020-08-23   8   9.0  10.0  11
2020-08-24  12  13.0  14.0  15
2020-08-25  16  17.0   NaN  19
2020-08-26  20  21.0  22.0  23

In [23]:
print(df.dropna(axis=0, how='any'))   # how: 设置丢掉数据的方式 {'any', 'all'}

             a     b     c   d
2020-08-22   4   5.0   6.0   7
2020-08-23   8   9.0  10.0  11
2020-08-24  12  13.0  14.0  15
2020-08-26  20  21.0  22.0  23

In [24]:
print(df.fillna(value=0))    # 填充丢失数据

             a     b     c   d
2020-08-21   0   0.0   2.0   3
2020-08-22   4   5.0   6.0   7
2020-08-23   8   9.0  10.0  11
2020-08-24  12  13.0  14.0  15
2020-08-25  16  17.0   0.0  19
2020-08-26  20  21.0  22.0  23

In [25]:
print(df.isna())       # 检查是否存在丢失数据

                a      b      c      d
2020-08-21  False   True  False  False
2020-08-22  False  False  False  False
2020-08-23  False  False  False  False
2020-08-24  False  False  False  False
2020-08-25  False  False   True  False
2020-08-26  False  False  False  False

In [26]:
print(np.any(df.isna() == True))

True

# 4.Pandas读取与写入数据

In [27]:
import pandas as pd

In [29]:
df = pd.read_csv('./data/ex1.csv',sep='\t')  
df

   Student ID   name  age  gender
0        1001   Adam   20  Female
1        1002    Bob   25  Female
2        1003   Cris   32  Female
3        1004  Deric   45  Female
4        1005   Emma   19    Male
5        1006   Fido   45    Male
6        1007   Gill   30  Female
7        1008  Herry   28    Male
8        1009    Jim   22    Male
9        1010   King   15  Female

考虑文件不存在header row的情况

In [33]:
df = pd.read_csv('./data/ex2.csv', header=None)
df

      0      1   2       3
0  1001   Adam  20  Female
1  1002    Bob  25  Female
2  1003   Cris  32  Female
3  1004  Deric  45  Female
4  1005   Emma  19    Male
5  1006   Fido  45    Male
6  1007   Gill  30  Female
7  1008  Herry  28    Male
8  1009    Jim  22    Male
9  1010   King  15  Female

可以在读取时显示指定column

In [34]:
df = pd.read_csv('./data/ex2.csv', names=['Student ID','name','age','gender'])
df

   Student ID   name  age  gender
0        1001   Adam   20  Female
1        1002    Bob   25  Female
2        1003   Cris   32  Female
3        1004  Deric   45  Female
4        1005   Emma   19    Male
5        1006   Fido   45    Male
6        1007   Gill   30  Female
7        1008  Herry   28    Male
8        1009    Jim   22    Male
9        1010   King   15  Female

传入时指定多列索引

In [35]:
df = pd.read_csv('./data/mutindex.csv', index_col=['key1','key2'])
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [36]:
df.index

MultiIndex(levels=[['one', 'two'], ['a', 'b', 'c', 'd']],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 3, 0, 1, 2, 3]],
           names=['key1', 'key2'])

**写入数据**

In [38]:
df = pd.read_csv('./data/mutindex.csv', index_col=['key1','key2'])
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [39]:
df.to_csv('./data/out.csv')

使用sys.stdout打印文本，方便查看效果

In [47]:
import sys

In [48]:
df.to_csv(sys.stdout, sep='|')

key1|key2|value1|value2
one|a|1|2
one|b|3|4
one|c|5|6
one|d|7|8
two|a|9|10
two|b|11|12
two|c|13|14
two|d|15|16

**JSON格式数据**

In [49]:
obj = """ 
{"name": "Wes", 
 "places_lived": ["United States", "Spain", "Germany"], 
 "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, 
                           {"name": "Katie", "age": 38, 
                            "pets": ["Sixes", "Stache", "Cisco"]}] 
} 
"""

In [50]:
import json

In [51]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [53]:
type(result)

dict

使用json.dumps,将python object转换为JSON

In [55]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [59]:
type(asjson)

str

In [60]:
type(result)

dict

In [61]:
# 将json格式数据先存储到本地  dict--->json字符串格式
filename = './data/example.json'

with open(filename, 'w') as f:
    json.dump(result, f)

**这里概括一下json.loads()、json.load()、json.dump()、json.dumps()区别和用法**  
1. load与loads：反序列化，将序列化的对象重新读入内存
  - load：用于文件的读取。json格式字符串转化为dict
  - loads: 用于内存对象之间转换。string转换为dict
2. dump与dumps: 序列化，将对象状态转换为可保存或可传输格式
  - dump: 用于文件的写入。dict类型转换为json格式字符串
  - dumps: 用于内存对象之间转换。dict转换为string  
    
更加详细的解释可见下面这篇博客。  
[json中load和loads的区别](https://www.cnblogs.com/bigtreei/p/10466518.html)

# 5.XML和HTML：Web Scraping
python有很多包用来读取和写入HTML和XML格式。比如:lxml, Beautiful Soup, html5lib。其中lxml比较快，其他一些包则能更好的处理一些复杂的HTML和XML文件。

pandas有一个内建的函数，叫read_html, 这个函数利用lxml和Beautiful Soup这样的包来自动解析HTML，变为DataFrame。这里我们必须要先下载这些包才能使用read_html:

In [63]:
tables = pd.read_html('./data/fdic_failed_bank_list.html')

In [64]:
len(tables)

1

In [66]:
tables

[                                  Bank Name             City  ST   CERT  \
 0                               Allied Bank         Mulberry  AR     91
 1              The Woodbury Banking Company         Woodbury  GA  11297
 2                    First CornerStone Bank  King of Prussia  PA  35312
 3                        Trust Company Bank          Memphis  TN   9956
 4                North Milwaukee State Bank        Milwaukee  WI  20364
 5                    Hometown National Bank         Longview  WA  35156
 6                       The Bank of Georgia   Peachtree City  GA  35259
 7                              Premier Bank           Denver  CO  34112
 8                            Edgebrook Bank          Chicago  IL  57772
 9                    Doral Bank  En Espanol         San Juan  PR  32102
 10        Capitol City Bank & Trust Company          Atlanta  GA  33938
 11                  Highland Community Bank          Chicago  IL  20290
 12         First National Bank of Crestview        Crestview  FL  17557
 13                       Northern Star Bank          Mankato  MN  34983
 14   Frontier Bank, FSB D/B/A El Paseo Bank      Palm Desert  CA  34738
 15    The National Republic Bank of Chicago          Chicago  IL    916
 16                           NBRS Financial       Rising Sun  MD   4862
 17                    GreenChoice Bank, fsb          Chicago  IL  28462
 18                 Eastside Commercial Bank          Conyers  GA  58125
 19                   The Freedom State Bank          Freedom  OK  12483
 20                              Valley Bank  Fort Lauderdale  FL  21793
 21                              Valley Bank           Moline  IL  10450
 22              Slavie Federal Savings Bank          Bel Air  MD  32368
 23                    Columbia Savings Bank       Cincinnati  OH  32284
 24             AztecAmerica Bank En Espanol           Berwyn  IL  57866
 25                    Allendale County Bank          Fairfax  SC  15062
 26                       Vantage Point Bank          Horsham  PA  58531
 27    Millennium Bank, National Association         Sterling  VA  35096
 28                             Syringa Bank            Boise  ID  34296
 29                        The Bank of Union          El Reno  OK  17967
 ..                                      ...              ...  ..    ...
 517                       ANB Financial, NA      Bentonville  AR  33901
 518                               Hume Bank             Hume  MO   1971
 519                  Douglass National Bank      Kansas City  MO  24660
 520                       Miami Valley Bank         Lakeview  OH  16848
 521                                 NetBank       Alpharetta  GA  32575
 522               Metropolitan Savings Bank       Pittsburgh  PA  35353
 523                         Bank of Ephraim          Ephraim  UT   1249
 524                           Reliance Bank     White Plains  NY  26778
 525   Guaranty National Bank of Tallahassee      Tallahassee  FL  26838
 526                     Dollar Savings Bank           Newark  NJ  31330
 527                    Pulaski Savings Bank     Philadelphia  PA  27203
 528   First National Bank of Blanchardville   Blanchardville  WI  11639
 529                   Southern Pacific Bank         Torrance  CA  27094
 530             Farmers Bank of Cheneyville      Cheneyville  LA  16445
 531                           Bank of Alamo            Alamo  TN   9961
 532  AmTrade International Bank  En Espanol          Atlanta  GA  33784
 533          Universal Federal Savings Bank          Chicago  IL  29355
 534            Connecticut Bank of Commerce         Stamford  CT  19183
 535                        New Century Bank  Shelby Township  MI  34979
 536                   Net 1st National Bank       Boca Raton  FL  26652
 537                            NextBank, NA          Phoenix  AZ  22314
 538                Oakwood Deposit Bank Co.          Oakwood  OH   8966
 539                   Bank of Sierra Blanca    Sierra Blanca  TX  22002
 540           Hamilton Bank, NA  En Espanol            Miami  FL  24382
 541                  Sinclair National Bank         Gravette  AR  34248
 542                      Superior Bank, FSB         Hinsdale  IL  32646
 543                     Malta National Bank            Malta  OH   6629
 544         First Alliance Bank & Trust Co.       Manchester  NH  34264
 545       National State Bank of Metropolis       Metropolis  IL   3815
 546                        Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 5                         Twin City Bank     October 2, 2015
 6                          Fidelity Bank     October 2, 2015
 7              United Fidelity Bank, fsb       July 10, 2015
 8               Republic Bank of Chicago         May 8, 2015
 9           Banco Popular de Puerto Rico   February 27, 2015
 10   First-Citizens Bank & Trust Company   February 13, 2015
 11             United Fidelity Bank, fsb    January 23, 2015
 12                        First NBC Bank    January 16, 2015
 13                             BankVista   December 19, 2014
 14     Bank of Southern California, N.A.    November 7, 2014
 15                   State Bank of Texas    October 24, 2014
 16                           Howard Bank    October 17, 2014
 17                  Providence Bank, LLC       July 25, 2014
 18             Community & Southern Bank       July 18, 2014
 19       Alva State Bank & Trust Company       June 27, 2014
 20   Landmark Bank, National Association       June 20, 2014
 21                   Great Southern Bank       June 20, 2014
 22                         Bay Bank, FSB        May 30, 2014
 23             United Fidelity Bank, fsb        May 23, 2014
 24              Republic Bank of Chicago        May 16, 2014
 25                   Palmetto State Bank      April 25, 2014
 26                     First Choice Bank   February 28, 2014
 27                  WashingtonFirst Bank   February 28, 2014
 28                          Sunwest Bank    January 31, 2014
 29                             BancFirst    January 24, 2014
 ..                                   ...                 ...
 517       Pulaski Bank and Trust Company         May 9, 2008
 518                        Security Bank       March 7, 2008
 519       Liberty Bank and Trust Company    January 25, 2008
 520         The Citizens Banking Company     October 4, 2007
 521                           ING DIRECT  September 28, 2007
 522  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 523                        Far West Bank       June 25, 2004
 524                     Union State Bank      March 19, 2004
 525              Hancock Bank of Florida      March 12, 2004
 526                          No Acquirer   February 14, 2004
 527                       Earthstar Bank   November 14, 2003
 528                        The Park Bank         May 9, 2003
 529                            Beal Bank    February 7, 2003
 530            Sabine State Bank & Trust   December 17, 2002
 531                          No Acquirer    November 8, 2002
 532                          No Acquirer  September 30, 2002
 533               Chicago Community Bank       June 27, 2002
 534                   Hudson United Bank       June 26, 2002
 535                          No Acquirer      March 28, 2002
 536                       Bank Leumi USA       March 1, 2002
 537                          No Acquirer    February 7, 2002
 538       The State Bank & Trust Company    February 1, 2002
 539     The Security State Bank of Pecos    January 18, 2002
 540     Israel Discount Bank of New York    January 11, 2002
 541                   Delta Trust & Bank   September 7, 2001
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

            Updated Date
 0     November 17, 2016
 1     November 17, 2016
 2     September 6, 2016
 3     September 6, 2016
 4         June 16, 2016
 5        April 13, 2016
 6      October 24, 2016
 7       August 17, 2016
 8         July 12, 2016
 9          May 13, 2015
 10       April 21, 2015
 11       April 21, 2015
 12     January 15, 2016
 13      January 6, 2016
 14    November 10, 2016
 15      January 6, 2016
 16       March 26, 2015
 17        July 28, 2015
 18        July 11, 2016
 19       March 25, 2016
 20        June 29, 2015
 21        June 26, 2015
 22        June 15, 2015
 23    November 10, 2016
 24     October 20, 2016
 25        July 18, 2014
 26        March 3, 2015
 27       March 03, 2015
 28       April 12, 2016
 29       March 25, 2016
 ..                  ...
 517     August 28, 2012
 518     August 28, 2012
 519    October 26, 2012
 520  September 12, 2016
 521     August 28, 2012
 522    October 27, 2010
 523       April 9, 2008
 524       April 9, 2008
 525        June 5, 2012
 526       April 9, 2008
 527       July 22, 2005
 528        June 5, 2012
 529    October 20, 2008
 530    October 20, 2004
 531      March 18, 2005
 532  September 11, 2006
 533       April 9, 2008
 534   February 14, 2012
 535      March 18, 2005
 536       April 9, 2008
 537    February 5, 2015
 538    October 25, 2012
 539    November 6, 2003
 540  September 21, 2015
 541   February 10, 2004
 542     August 19, 2014
 543   November 18, 2002
 544   February 18, 2003
 545      March 17, 2005
 546      March 17, 2005

 [547 rows x 7 columns]]

In [67]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [68]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
type(close_timestamps)

pandas.core.series.Series

In [70]:
close_timestamps.head()

0   2016-09-23
1   2016-08-19
2   2016-05-06
3   2016-04-29
4   2016-03-11
Name: Closing Date, dtype: datetime64[ns]

In [72]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

# 6.Pandas数据的合并

In [76]:
# concatenating
df1 = pd.DataFrame(np.ones((3,4))*0, columns=['a','b','c','d'])
df2 = pd.DataFrame(np.ones((3,4))*1, columns=['a','b','c','d'])
df3 = pd.DataFrame(np.ones((3,4))*2, columns=['a','b','c','d'])

In [78]:
merged = pd.concat([df1,df2,df3], axis=0)
merged

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
0  2.0  2.0  2.0  2.0
1  2.0  2.0  2.0  2.0
2  2.0  2.0  2.0  2.0

In [80]:
merged = pd.concat([df1,df2,df3], axis=0, ignore_index=True)  # 重新排列索引
merged

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0
6  2.0  2.0  2.0  2.0
7  2.0  2.0  2.0  2.0
8  2.0  2.0  2.0  2.0

In [81]:
df1 = pd.DataFrame(np.ones((3,4))*0, columns=['a','b','c','d'], index=[1,2,3])
df2 = pd.DataFrame(np.ones((3,4))*1, columns=['b','c','d','e'], index=[2,3,4])
print(df1)
print()
print(df2)

     a    b    c    d
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

     b    c    d    e
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

这里的join类似于数据库中的连接

In [82]:
merged = pd.concat([df1,df2],join='inner')
print(merged)

     b    c    d
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0

In [83]:
merged = pd.concat([df1,df2],join='outer')
print(merged)

     a    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
3  0.0  0.0  0.0  0.0  NaN
2  NaN  1.0  1.0  1.0  1.0
3  NaN  1.0  1.0  1.0  1.0
4  NaN  1.0  1.0  1.0  1.0

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.